/*

На выбор:

Создать клиент-серверный калькулятор для работы с вещественными числами.
Вычисление должно быть на сервере. Принимаем выражение для вычисления от пользователя на клиенте.
*Добавить возможность логирования.
**Можно усложнить, если клиент будет отправлять выражение с несколькими действиями сразу, например: 3*10-(20+14)/2 (используя стек для парсинга).

Создать телефонный справочник с возможностью импорта и экспорта данных в нескольких форматах (txt, csv, xml, json).
под форматами понимаем структуру файлов, например: в файле на одной строке хранится одна часть записи, пустая строка - разделитель

**Сделать клиент серверную версию, чтобы клиент вводил данные для справочника в консоль.

Создать информационную систему позволяющую работать с сотрудниками некой компании \ студентами вуза \ учениками школы - добавлять, удалять, изменять данные о сотруднике, выводить информацию о них.
**Сделать клиент серверную версию, чтобы клиент вводил данные о сотруднике \ студенте \ ученике.
 */



package Client;

public class Main {
    public static void main(String[] args) {

    }
}