package PhoneBook.ConsoleMenu;

public class MyMenu {

    public String menuConsole() {
        return "\nТелефонный справочник\n \nВыберите пункт:\n" +
                "1. Показать cправочник.\n" +
                "2. Количество контактов.\n" +
                "3. Найти контакт.\n" +
                "4. Добавить контакт.\n" +
                "5. Удалить контакт.\n" +
                "6. Выгрузить справочник.\n" +
                "7. Загрузить справочник.\n" +
                "\n" +
                "0. Выход\n" +
                "" +
                "\nВведите номер задачи --> ";
    }

    public String fileFormat() {
        return "\nВ каком формате сохранить справочник:\n" +
                "1. В формате txt\n" +
                "2. В фортмате csv\n" +
                "" +
                "\nВведите номер пункта --> ";
    }

    public String nameFileFormat() {
        return "\nВведите название файла --> ";
    }
}
